[Timeout] BlockStatement
src/Roller.ts:9:32
     // specifies the number of faces the die has. It must have at least 2 faces
     // so any invalid values should default to 6 to represent the common 
     // six-sided die.
-    constructor(faces: number) {
-        if(faces<2){
-            this._faces = 6;
-        }
-        else{
-            this._faces = faces;
-        }
-        this._distribution = new Map<number,number>();
-        for(let i=1; i<=this._faces; i++){
-            this._distribution.set(i,0);
-        }
-        // faces;
-    }
+    constructor(faces: number) {}
 
     // specifies which number should be rolled and returns the recorded roll. 

[Timeout] BlockStatement
src/Roller.ts:10:20
     // so any invalid values should default to 6 to represent the common 
     // six-sided die.
     constructor(faces: number) {
-        if(faces<2){
-            this._faces = 6;
-        }
+        if(faces<2){}
         else{
             this._faces = faces;

[Timeout] BlockStatement
src/Roller.ts:13:13
         if(faces<2){
             this._faces = 6;
         }
-        else{
-            this._faces = faces;
-        }
+        else{}
         this._distribution = new Map<number,number>();
         for(let i=1; i<=this._faces; i++){

[Timeout] BlockStatement
src/Roller.ts:33:32
     //   3. the distribution should update the distribution record so that the
     //      key (value rolled) has an updated value that increases the number
     //      of rolls for that face by 1
-    roll(value: number): number{
-        if(value<1 || value>this._faces){
-            return 0;
-        }
-        this._last = value;
-        this._distribution.set(value, this._distribution.get(value)+1);
-        return value;
-    }
+    roll(value: number): number{}
 
     // returns the value of the latest die roll. If no rolls have been made

[Timeout] BlockStatement
src/Roller.ts:44:20
 
     // returns the value of the latest die roll. If no rolls have been made
     // yet, then it should return 0.
-    last(): number {
-        if(this._last===null){
-            return 0;
-        }
-        else{
-            return this._last;
-        }
-        
-    }
+    last(): number {}
 
     // returns a Map that represents the current distribution of rolls for each

[Timeout] ConditionalExpression
src/Roller.ts:45:12
     // returns the value of the latest die roll. If no rolls have been made
     // yet, then it should return 0.
     last(): number {
-        if(this._last===null){
+        if(false){
             return 0;
         }

[Timeout] BlockStatement
src/Roller.ts:48:13
         if(this._last===null){
             return 0;
         }
-        else{
-            return this._last;
-        }
+        else{}
         
     }

[Timeout] BlockStatement
src/Roller.ts:59:40
     // value and its value should be the number of times that face has been
     // rolled. Even if a face has not yet been rolled, its key should have a
     // value of 0.
-    distribution(): Map<number, number>{
-        const newMap = new Map<number, number>();
-        for(let i=1;i<=this._faces;i++){
-            newMap.set(i, this._distribution.get(i));
-        }
-        return newMap;
-    }
+    distribution(): Map<number, number>{}
 } // end of Roller class

[Killed] EqualityOperator
src/Roller.ts:61:21
     // value of 0.
     distribution(): Map<number, number>{
         const newMap = new Map<number, number>();
-        for(let i=1;i<=this._faces;i++){
+        for(let i=1;i < this._faces;i++){
             newMap.set(i, this._distribution.get(i));
         }
killedBy: Roller tests distribution Function size check
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: 7

[Killed] EqualityOperator
src/Roller.ts:61:21
     // value of 0.
     distribution(): Map<number, number>{
         const newMap = new Map<number, number>();
-        for(let i=1;i<=this._faces;i++){
+        for(let i=1;i > this._faces;i++){
             newMap.set(i, this._distribution.get(i));
         }
killedBy: Roller tests distribution Function size check
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: 0
